# Python Data analysis beginner lessons

In [10]:
1+1+6

8

Dictionary

In [150]:
dict = {'Name:':'Festus', 'Age:':'26', 'City:': 'London', 'Sex:':'Male'}

In [151]:
dict['Name:']

'Festus'

In [77]:
for key, value in dict.items():
    print(key,value)

Name: Festus
Age: 26
City: London
Sex: Male

# List comprehention

List is a data structure that contains a number of objects in a precise order to form a sequence to which elements can be added and removed. In python we count from zero.

In [2]:
List = [1,2,3,4,5]
List

[1, 2, 3, 4, 5]

In [4]:
List[2]

3

In [7]:
List[2:4]

[3, 4]

In [11]:
List[1:3]

[2, 3]

In [18]:
Fruits = ['Apple', 'Orange', 'Banana', 'Grape', 'Pawpaw', 'Cherry']
Fruits

['Apple', 'Orange', 'Banana', 'Grape', 'Pawpaw', 'Cherry']

In [21]:
Fruits[-1]

'Cherry'

In [24]:
V = Fruits[1:5]
print(V)  # Output: ['Orange', 'Banana']

['Orange', 'Banana', 'Grape', 'Pawpaw']

In [6]:

#Create a list of numbers
numbers = [1, 2, 3, 4, 5]

# Create a list of strings
fruits = ['apple', 'banana', 'orange', 'grape', 'kiwi']

# Create a list of mixed data types
mixed = [1, 'apple', True, 3.14]

# Print the lists
print("Numbers:", numbers)
print("Fruits:", fruits)
print("Mixed:", mixed)

Numbers: [1, 2, 3, 4, 5]
Fruits: ['apple', 'banana', 'orange', 'grape', 'kiwi']
Mixed: [1, 'apple', True, 3.14]

In [149]:
numbers = [1, 2, 3, 4, 5]
numbers[4]

5

Adding different lists together into one document

In [31]:
Fruits1 = ['Apple', 'Banana', 'Orange', 'Grape', 'Kiwi']
Fruits2 = ['Pawpaw', 'Cherry']
Fruits3 = ['Berrie', 'Cashew']

Add = Fruits1 + Fruits2 + Fruits3

print (Add)

['Apple', 'Banana', 'Orange', 'Grape', 'Kiwi', 'Pawpaw', 'Cherry', 'Berrie', 'Cashew']

In [33]:
# Define four lists of alphabets
list1 = ['a', 'b', 'c']
list2 = ['d', 'e', 'f']
list3 = ['g', 'h', 'i']
list4 = ['j', 'k', 'l']

# Extend list1 with elements from list2, list3, and list4
list1.extend(list2)
list1.extend(list3)
list1.extend(list4)

# Print the result
print(list1)

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l']

Aranging two lists elements in alphabetical order

In [40]:
# Define two lists of names
list1 = ['John', 'Alice', 'Bob','Cain','Hannah', 'Israel']
list2 = ['Emma', 'Gabriel', 'David', 'Eva', 'Fred']

# Concatenate the lists
combined_list = list1 + list2

# Sort the combined list alphabetically
combined_list.sort()

# Print the result
print(combined_list)

['Alice', 'Bob', 'Cain', 'David', 'Emma', 'Eva', 'Fred', 'Gabriel', 'Hannah', 'Israel', 'John']

In [43]:
list1 = ['John', 'Alice', 'Bob','Cain','Hannah', 'Israel']
list1.append('Noah')


print(list1)

['John', 'Alice', 'Bob', 'Cain', 'Hannah', 'Israel', 'Noah']

In [46]:
list1 = ['John', 'Alice', 'Bob','Cain','Hannah', 'Israel', 'Israel']
list1.insert(0,'Noah')

print(list1)

['Noah', 'John', 'Alice', 'Bob', 'Cain', 'Hannah', 'Israel', 'Israel']

In [51]:
list1 = ['John', 'Alice', 'Bob','Cain','Hannah', 'Israel', 'Emma']
A = len(set(list1))

print(A)

7

In [97]:
list1 = ['John', 'Alice','Alice', 'Bob','Cain','Hannah', 'Israel', 'Israel', 'Israel']

list1.count('Israel')
Israel=list1.count('Israel')


list1.count('Alice')
Alice=list1.count('Alice')


print(Israel)
print(Alice)

3
2

### List funtions

list.pop(index): Removes and returns the element at the specified index. If no index is specified, removes and returns the last element.

In [14]:
my_list = [1, 2, 3, 2]
my_list.pop(2)
print(my_list)  # Output: [1, 3, 2]

[1, 2, 2]

list.remove(element): Removes the first occurrence of the specified element from the list.

In [15]:
my_list = [1, 2, 3, 2]
my_list.remove(1)
print(my_list)  # Output: [1, 3, 2]

[2, 3, 2]

Python loop function
There are mainly two type of loop, the (for) loop and the (while) loop

In [1]:
# Printing numbers from 1 to 5 using a while loop
num = 1
while num <= 5:
    print(num)
    num += 1

1
2
3
4
5

You can also control the flow of the loop using keywords like break to exit the loop prematurely or continue to skip the current iteration and move to the next one.

Here's an example using break:

In [20]:
# Example of using break in a loop
numbers = [1, 2, 3, 4, 5]
for num in numbers:
    if num == 3:
        break
    print(num)
    
    #This loop will print numbers 1 and 2, then break out of the loop when it encounters the number 3

1
2

In [1]:
# Example of using continue in a loop
numbers = [1, 2, 3, 4, 5]
for num in numbers:
    if num == 3:
        continue
    print(num)
    
    #This loop will print all numbers from 1 to 5 except for 3, as it skips the iteration when the number is 3.

1
2
4
5

In [2]:
# Example of a while loop
count = 0
while count < 5:
    print(count)
    count += 1

0
1
2
3
4

In [6]:
# Loop from 'A' to 'Z'
for char in range(ord('A'), ord('Z')+1):
    print(chr(char))

A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z


```

Explanation:

- `ord('A')` returns the ASCII value of 'A', which is 65.
- `ord('Z')` returns the ASCII value of 'Z', which is 90.
- `range(ord('A'), ord('Z')+1)` generates a range from 65 to 90 (inclusive).
- `chr(char)` converts each ASCII value back to its corresponding character.

So, this loop prints out each letter from 'A' to 'Z' on a separate line in your Jupyter Notebook.

In [2]:
# Loop from 'A' to 'Z'
for char in range(ord('A'), ord('Z')+1):
    print(chr(char), end=' ')

# Loop from 'a' to 'z'
for char in range(ord('a'), ord('z')+1):
    print(chr(char), end=' ')

A B C D E F G H I J K L M N O P Q R S T U V W X Y Z a b c d e f g h i j k l m n o p q r s t u v w x y z

# Assigment questions and answers

1.) The names of students in a class are stored in a list as shown below
    names = ["Carol", "Albert", "Ben", "Donna"]
    Add the following new students to the above list and sort them in alphabetical order.
    Phillip, Evans, Samuel, Tina, Eva. And find the total number of students in the class

In [17]:
names = ["Carol", "Albert", "Ben", "Donna"]

new_students = ["Phillip", "Evans", "Samuel", "Tina", "Eva"]

# Add new students to the existing list
names.extend(new_students)

# Sort the list alphabetically
names.sort()

# Total number of students in the class
total_students = len(names)

print("Updated list of students:", names)
print("Total number of students in the class:", total_students)

Updated list of students: ['Albert', 'Ben', 'Carol', 'Donna', 'Eva', 'Evans', 'Phillip', 'Samuel', 'Tina']
Total number of students in the class: 9

2.) Find the length, maximum, and minimum of the list below and also store them in a dictionary

    a = [1, 5, 8, 12, 9, 4, 5]
    
    b = [2, 6, 9, 10, 1, 3, 4, 5, 20]
    
    c = [100, 200, 30, 1, 30, 33, 5, 7]

In [18]:
a = [1, 5, 8, 12, 9, 4, 5]

b = [2, 6, 9, 10, 1, 3, 4, 5, 20]

c = [100, 200, 30, 1, 30, 33, 5, 7]

# Create a dictionary to store the results
results = {}

# Calculate length, maximum, and minimum for each list
for lst, name in zip([a, b, c], ['a', 'b', 'c']):
    results[name] = {
        'length': len(lst),
        'maximum': max(lst),
        'minimum': min(lst)
    }

# Print the results dictionary
print("Results:", results)

Results: {'a': {'length': 7, 'maximum': 12, 'minimum': 1}, 'b': {'length': 9, 'maximum': 20, 'minimum': 1}, 'c': {'length': 8, 'maximum': 200, 'minimum': 1}}

Another way to get your answer

In [19]:
a = [1, 5, 8, 12, 9, 4, 5]

b = [2, 6, 9, 10, 1, 3, 4, 5, 20]

c = [100, 200, 30, 1, 30, 33, 5, 7]

# Create a dictionary to store the results
results = {}

# Calculate length, maximum, and minimum for each list individually
results['a'] = {'length': len(a), 'maximum': max(a), 'minimum': min(a)}

results['b'] = {'length': len(b), 'maximum': max(b), 'minimum': min(b)}

results['c'] = {'length': len(c), 'maximum': max(c), 'minimum': min(c)}

# Print the results dictionary
print("Results:", results)

Results: {'a': {'length': 7, 'maximum': 12, 'minimum': 1}, 'b': {'length': 9, 'maximum': 20, 'minimum': 1}, 'c': {'length': 8, 'maximum': 200, 'minimum': 1}}

3.) my_verse = "if you can keep your head when all about you are losing theirs and blaming it on you if you can trust yourself when all men doubt you but make allowance for their doubting too if you can wait and not be tired by waiting or being lied about don’t deal in lies or being hated don’t give way to hating and yet don’t look too good nor talk too wise"

a.) Split the variable my_verse into a list of words.
b.) Convert the list into a data structure that would keep only the unique elements from the list.
c.) Print the length of the container.

In [65]:
my_verse = "if you can keep your head when all about you are losing theirs and blaming it on you if you can trust yourself when all men doubt you but make allowance for their doubting too if you can wait and not be tired by waiting or being lied about don’t deal in lies or being hated don’t give way to hating and yet don’t look too good nor talk too wise"

# Split the verse into a list of words
words_list = my_verse.split()
print("List of words:", words_list)

List of words: ['if', 'you', 'can', 'keep', 'your', 'head', 'when', 'all', 'about', 'you', 'are', 'losing', 'theirs', 'and', 'blaming', 'it', 'on', 'you', 'if', 'you', 'can', 'trust', 'yourself', 'when', 'all', 'men', 'doubt', 'you', 'but', 'make', 'allowance', 'for', 'their', 'doubting', 'too', 'if', 'you', 'can', 'wait', 'and', 'not', 'be', 'tired', 'by', 'waiting', 'or', 'being', 'lied', 'about', 'don’t', 'deal', 'in', 'lies', 'or', 'being', 'hated', 'don’t', 'give', 'way', 'to', 'hating', 'and', 'yet', 'don’t', 'look', 'too', 'good', 'nor', 'talk', 'too', 'wise']

In [64]:
#. Convert the list into a set to keep only unique elements
unique_words_set = set(words_list)
print("Set of unique words:", unique_words_set)

Set of unique words: {'all', 'hated', 'but', 'not', 'trust', 'head', 'waiting', 'and', 'by', 'if', 'good', 'allowance', 'doubting', 'way', 'men', 'don’t', 'talk', 'being', 'hating', 'wait', 'about', 'their', 'lied', 'it', 'your', 'look', 'you', 'when', 'blaming', 'or', 'keep', 'tired', 'give', 'yet', 'nor', 'make', 'on', 'wise', 'are', 'can', 'deal', 'to', 'in', 'yourself', 'be', 'too', 'lies', 'for', 'doubt', 'losing', 'theirs'}

In [23]:
# Print the length of the container
print("Length of the container:", len(unique_words_set))

Length of the container: 51

In [24]:
my_verse = "if you can keep your head when all about you are losing theirs and blaming it on you if you can trust yourself when all men doubt you but make allowance for their doubting too if you can wait and not be tired by waiting or being lied about don’t deal in lies or being hated don’t give way to hating and yet don’t look too good nor talk too wise"

# Split the verse into a list of words
words_list = my_verse.split()
print("List of words:", words_list)

# Convert the list into a set to keep only unique elements
unique_words_set = set(words_list)
print("Set of unique words:", unique_words_set)

# Print the length of the container
print("Length of the container:", len(unique_words_set))

List of words: ['if', 'you', 'can', 'keep', 'your', 'head', 'when', 'all', 'about', 'you', 'are', 'losing', 'theirs', 'and', 'blaming', 'it', 'on', 'you', 'if', 'you', 'can', 'trust', 'yourself', 'when', 'all', 'men', 'doubt', 'you', 'but', 'make', 'allowance', 'for', 'their', 'doubting', 'too', 'if', 'you', 'can', 'wait', 'and', 'not', 'be', 'tired', 'by', 'waiting', 'or', 'being', 'lied', 'about', 'don’t', 'deal', 'in', 'lies', 'or', 'being', 'hated', 'don’t', 'give', 'way', 'to', 'hating', 'and', 'yet', 'don’t', 'look', 'too', 'good', 'nor', 'talk', 'too', 'wise']
Set of unique words: {'wise', 'head', 'trust', 'too', 'yourself', 'doubt', 'hating', 'about', 'nor', 'in', 'theirs', 'wait', 'on', 'for', 'or', 'doubting', 'don’t', 'yet', 'allowance', 'blaming', 'all', 'being', 'lies', 'hated', 'are', 'give', 'it', 'talk', 'by', 'keep', 'and', 'you', 'your', 'tired', 'to', 'but', 'look', 'way', 'when', 'men', 'make', 'waiting', 'deal', 'lied', 'losing', 'if', 'be', 'not', 'can', 'good', 'their'}
Length of the container: 51

4.)  Convert the following string object into list
    str_numbers = "2343432390833473"

In [32]:
str_numbers = "2343432390833473"

# Convert each character to an integer and store in a list
list_numbers = [int(char) for char in str_numbers]

print("List of individual integers:", list_numbers)

List of individual integers: [2, 3, 4, 3, 4, 3, 2, 3, 9, 0, 8, 3, 3, 4, 7, 3]

5.) Return the first and last element of the list below
    z = [2, 3, 10, 1, 0, 23, 15, 5, 3, 12]

In [110]:
z = [2, 3, 10, 1, 0, 23, 15, 5, 3, 12]
#
first_element = z[0]
#
last_element = z[-1]

print('first_element', first_element)
print('last_element', last_element)

first_element 2
last_element 12

6.)  What parameters should be sent to the range constructor, to produce a range with values 50, 60, 70, 80?

In [121]:
# Calculate the start value
start = 50

# Calculate the stop value (exclusive)
stop = 81

# Calculate the step value
step = 10

# Create the range
my_range = range(start, stop, step)
my_range

range(50, 81, 10)

7.)  What parameters should be sent to the range constructor, to produce a range with values 8, 6, 4, 2, 0, -2, -4, -6, -8?

In [109]:
for i in range(8, -10, -2):
    print(i)

8
6
4
2
0
-2
-4
-6
-8

8.)Write a for loop to print all numbers from 1 to 10.b. Write a while loop to print all even numbers from 2 to 10.

In [65]:
 # a. Print all numbers from 1 to 10 using the range() function
print("Numbers from 1 to 10:")
for i in range(1, 11):
    print(i)

# b. Print all even numbers from 2 to 10 using the range() function
print("Even numbers from 2 to 10:")
for i in range(2, 11, 2):
    print(i)

# c. Print all numbers from 10 to 1 in reverse order using the range() function
print("Numbers from 10 to 1 in reverse order:")
for i in range(10, 0, -1):
    print(i)

Numbers from 1 to 10:
1
2
3
4
5
6
7
8
9
10
Even numbers from 2 to 10:
2
4
6
8
10
Numbers from 10 to 1 in reverse order:
10
9
8
7
6
5
4
3
2
1

9.) 9.Print all numbers from 1 to 10 using the range() function.
b. Print all even numbers from 2 to 10 using the range() function
.c. Print all numbers from 10 to 1 in reverse order using the range() function.

In [5]:
# For loop to print numbers from 1 to 10
print("Numbers from 1 to 10:")
for i in range(1, 11):
    print(i)

# While loop to print even numbers from 2 to 10
print("Even numbers from 2 to 10:")
num = 2
while num <= 10:
    print(num)
    num += 2

Numbers from 1 to 10:
1
2
3
4
5
6
7
8
9
10
Even numbers from 2 to 10:
2
4
6
8
10

# DATA ANALYSIS

Data analysis is the process of examining, cleaning, transforming, and interpreting data to uncover meaningful insights, patterns, and trends. It involves applying various techniques, statistical methods, and computational tools to extract valuable information from raw data.

The Data Analysis Process:

Data analysis can be described as a process consisting of several steps in which the raw data are transformed 
and processed in order to produce data visualizations and can make predictions thanks to a mathematical 
model based on the collected data. Then, data analysis is nothing more than a sequence of steps, each of 
which plays a key role in the subsequent ones. So, data analysis is almost schematized as a process chain 
consisting of the following sequence of stages:

•	 Problem definition

•	 Data extraction

•	 Data cleaning

•	 Data transformation

•	 Data exploration

•	 Predictive modeling

•	 Model validation/test

•	 Visualization and interpretation of results

•	 Deployment of the solution

#### Python libraries for data analytics (Pandas & Numpy)

Pandas is a Python library renowned for its user-friendly data structures and powerful data analysis tools. It introduces Series and DataFrame for one- and two-dimensional data manipulation, respectively. With Pandas, users can perform a wide range of tasks including data selection, filtering, grouping, joining, and aggregation. Built on NumPy, Pandas ensures high performance, making it suitable for handling large datasets efficiently. Its versatility allows it to handle various data types and domains, while its extensive community support provides ample resources for learning and problem-solving. In essence, Pandas stands as a cornerstone for data analysis in Python due to its simplicity, versatility, and performance.

NumPy is a Python library essential for numerical computing, offering support for multi-dimensional arrays and matrices. It provides a vast array of mathematical functions, efficient indexing, and slicing operations. NumPy's broadcasting feature simplifies operations on arrays with different shapes. It includes functions for linear algebra, random number generation, and seamlessly integrates with other scientific computing libraries. Implemented in C, NumPy ensures high performance and efficiency, making it a cornerstone of Python's scientific computing ecosystem.

**Important basics for data analysis**

1. **Types of Data**:
   - **Structured Data**: Data that is organized in a pre-defined format, typically with a clear schema, such as relational databases where data is stored in tables with rows and columns.
   - **Unstructured Data**: Data that lacks a predefined structure, making it challenging to organize and analyze without additional processing. Examples include text documents, images, videos, and audio recordings.
   - **Semi-Structured Data**: Data that does not conform to a rigid structure like structured data but contains some organizational properties. Examples include JSON, XML, and CSV files where data may have a defined schema but with flexibility in data types and values.

2. **Data Sources and Collection**:
   - **Data Sources**: Data can originate from various sources such as databases, files (CSV, Excel, JSON), web APIs, sensors, social media, and surveys.
   - **Data Collection**: Methods for collecting data include manual entry, automated data collection systems, web scraping, IoT devices, and data streams from sensors or instruments.

3. **Data Cleaning and Preprocessing**:
   - **Data Cleaning**: The process of detecting and correcting (or removing) errors and inconsistencies in the data. This includes handling missing values, correcting typos, dealing with outliers, and resolving inconsistencies.
   - **Data Preprocessing**: Preparation of data for analysis, including tasks such as data normalization, standardization, feature scaling, encoding categorical variables, and feature engineering to create new variables or features from existing ones.

4. **Data Storage**:
   - **Database Systems**: Structured data is commonly stored in relational database management systems (RDBMS) like MySQL, PostgreSQL, or SQL Server, using tables to organize data.
   - **Data Warehouses**: Specialized databases designed for storing and analyzing large volumes of structured and semi-structured data, often used for business intelligence and analytics.
   - **Data Lakes**: Storage systems that can store vast amounts of raw data in its native format, providing flexibility for analysis and exploration, commonly used for unstructured and semi-structured data.

5. **Basic Data Terminology**:
   - **Rows**: Also known as records or observations, represent individual entries in a dataset.
   - **Columns**: Also known as fields or variables, represent the attributes or features of the data.
   - **Variables**: Characteristics or properties of interest that describe the data being collected or analyzed.
   - **Observations**: Instances or samples of data collected or recorded, each consisting of a set of variables.

In [100]:
#to beging our work in the pandas dataframe we must first import pandas into our jupytal notebook

import pandas as pd

# Creating a DataFrame from a dictionary
data = {'NAME': ['Alice', 'Bob','Charlie', 'David'],
        'AGE': [25, 30, 35, 40],
        'GENDER': ['Female', 'Male', 'Male', 'Male']}
df = pd.DataFrame(data)

print(df)

      NAME  AGE  GENDER
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   35    Male
3    David   40    Male

In [101]:
print(df.head(2)) #first row

    NAME  AGE  GENDER
0  Alice   25  Female
1    Bob   30    Male

In [102]:
print(df.tail(2)) #last row

      NAME  AGE GENDER
2  Charlie   35   Male
3    David   40   Male

In [103]:

print(df['GENDER']) #bringing out specific column

0    Female
1      Male
2      Male
3      Male
Name: GENDER, dtype: object

In [104]:
print(df.loc[1])

NAME       Bob
AGE         30
GENDER    Male
Name: 1, dtype: object

In [105]:
df['CITY'] = ['New York', 'Los Angeles', 'Chicago', 'Houston']
print("DataFrame after adding 'CITY' column:")
print(df)

DataFrame after adding 'CITY' column:
      NAME  AGE  GENDER         CITY
0    Alice   25  Female     New York
1      Bob   30    Male  Los Angeles
2  Charlie   35    Male      Chicago
3    David   40    Male      Houston

In [106]:
df.drop('GENDER', axis=1, inplace=True)
print("\nDataFrame after deleting 'GENDER' column:")
print(df)

DataFrame after deleting 'GENDER' column:
      NAME  AGE         CITY
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [12]:
df['AGE']

0    25
1    30
2    35
3    40
Name: AGE, dtype: int64

In [13]:
df

      NAME  AGE         CITY
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [14]:
data = {'NAME': ['Alice', 'Bob','Charlie', 'David'],
        'AGE': [25, 30, 35, 40],
        'GENDER': ['Female', 'Male', 'Male', 'Male']}
df = pd.DataFrame(data)

print(df)

      NAME  AGE  GENDER
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   35    Male
3    David   40    Male

In [15]:
df

      NAME  AGE  GENDER
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   35    Male
3    David   40    Male

In [24]:
# Getting the index of the row containing 'Bob'

index_to_drop = df[df['NAME'] == 'Bob']
index_to_drop

  NAME  AGE GENDER
1  Bob   30   Male

In [29]:
index_to_drop = df[df['NAME'] !='Bob']
index_to_drop

      NAME  AGE  GENDER
0    Alice   25  Female
2  Charlie   35    Male
3    David   40    Male

In [31]:
df

      NAME  AGE  GENDER
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   35    Male
3    David   40    Male

In [33]:
import pandas as pd

# Provided data dictionary
data = {'NAME': ['Alice', 'Bob','Charlie', 'David', 'David'],
        'AGE': [25, 30, 35, 40, 43],
        'GENDER': ['Female', 'Male', 'Male', 'Male','Male']}

# Creating DataFrame
df = pd.DataFrame(data)

# Getting the index of the row containing 'Bob'
index_to_drop = df[df['NAME'] == 'Bob'].index

# Deleting the row containing 'Bob' using the drop() function
df.drop(index_to_drop, inplace=True)

# Printing the modified DataFrame
print(df)

      NAME  AGE  GENDER
0    Alice   25  Female
2  Charlie   35    Male
3    David   40    Male
4    David   43    Male

In [37]:
# Changing the age of 'Alice' to 60 using boolean indexing
df.loc[df['NAME'] == 'David', 'AGE'] = 60

df

      NAME  AGE  GENDER
0    Alice   60  Female
2  Charlie   35    Male
3    David   60    Male
4    David   60    Male

In [41]:
df.loc[df['NAME'] == 'David', 'GENDER'] ='Female'
df

      NAME  AGE  GENDER
0    Alice   60  Female
2  Charlie   35    Male
3    David   60  Female
4    David   60  Female

In [44]:
index_to_change = df[df['NAME'] == 'David'].index[-1]
index_to_change #q
df.loc[index_to_change, 'GENDER'] = 'Male'
df

      NAME  AGE  GENDER
0    Alice   60  Female
2  Charlie   35    Male
3    David   60  Female
4    David   60    Male

In [62]:
import pandas as pd

# First dataset
data1 = {'NAME': ['Alice', 'Bob', 'Charlie', 'David', 'David'],
         
         'AGE': [25, 30, 35, 40, 43],
         'GENDER': ['Female', 'Male', 'Male', 'Male', 'Male'],
        'CITY': ['London', 'Los angeles', 'Abuja', 'Nairobi', 'Lagos']}
df1 = pd.DataFrame(data1)

# Second dataset
data2 = {'NAME': ['Queen', 'Sarah', 'Angela'],
         'AGE': [20, 34, 21],
         'GENDER': ['Female', 'Female','Female'],
        'CITY':['Benin','Manchester','Paris']}

df2 = pd.DataFrame(data2)

# Append rows of df2 to df1
merged_df = df1.append(df2, ignore_index=True)

# Printing the merged DataFrame
print(merged_df)

      NAME  AGE  GENDER         CITY
0    Alice   25  Female       London
1      Bob   30    Male  Los angeles
2  Charlie   35    Male        Abuja
3    David   40    Male      Nairobi
4    David   43    Male        Lagos
5    Queen   20  Female        Benin
6    Sarah   34  Female   Manchester
7   Angela   21  Female        Paris

In [67]:
merged_df

      NAME  AGE  GENDER         CITY
0    Alice   25  Female       London
1      Bob   30    Male  Los angeles
2  Charlie   35    Male        Abuja
3    David   40    Male      Nairobi
4    David   43    Male        Lagos
5    Queen   20  Female        Benin
6    Sarah   34  Female   Manchester
7   Angela   21  Female        Paris

In [70]:
merged_df_sort = merged_df.sort_values(by='NAME')
merged_df_sort

      NAME  AGE  GENDER         CITY
0    Alice   25  Female       London
7   Angela   21  Female        Paris
1      Bob   30    Male  Los angeles
2  Charlie   35    Male        Abuja
3    David   40    Male      Nairobi
4    David   43    Male        Lagos
5    Queen   20  Female        Benin
6    Sarah   34  Female   Manchester

In [72]:
Add_noah = {'NAME': ['Noah'],
             'AGE': [28],
             'GENDER': ['Male'],
           'CITY':['Munic']} #

df_noah = pd.DataFrame(Add_noah)

merged_df_sort = merged_df.append(df_noah, ignore_index=True) #

merged_df_sort

      NAME  AGE  GENDER         CITY
0    Alice   25  Female       London
1      Bob   30    Male  Los angeles
2  Charlie   35    Male        Abuja
3    David   40    Male      Nairobi
4    David   43    Male        Lagos
5    Queen   20  Female        Benin
6    Sarah   34  Female   Manchester
7   Angela   21  Female        Paris
8     Noah   28    Male        Munic

In [87]:
# Count occurrences of 'David' in the 'NAME' column
david_count = merged_df_sort['NAME'].value_counts().get('David')

# Print the count
print("Number of occurrences of 'David':", david_count)

Number of occurrences of 'David': 2

In [93]:
# Count occurrences of 'David' using boolean indexing
david_count = len(merged_df_sort[merged_df_sort['NAME'] == 'David']) #

print("Number of occurrences of 'David':", david_count)

Number of occurrences of 'David': 2

In [108]:
A= 'hungry'
A

'hungry'